Repository: ramiroencinas/perl6doc-es
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: es_es

source: "unsigned long long", or "quad" (typically
es_es: "unsigned long long", o "quad" (típicamente

source: # ensure the leading "0" for any octal,
es_es: # asegura el precedente "0" para cualquier octal,

source: # BUILD is the equivalent of a constructor in other languages
es_es: # BUILD equivale a un constructor en otros lenguajes

source: # Create a new Rectangle from two Points
es_es: # Crea un Rectángulo nuevo desde dos Puntos

source: # Done.
es_es: # Realizado.

source: # Normally doesn't need to be written
es_es: # En casos normales no es necesario

source: # OR
es_es: # o

source: # OUTPUT: «X::ControlFlow::Return: Attempt to return outside of any Routine␤»
es_es: # SALIDA: «X::ControlFlow::Return: Attempt to return outside of any Routine␤»

source: # Output:
es_es: # Salida:

source: # Output: foo bar
es_es: # Salida: foo bar

source: # Output: this line has foo
es_es: # Salida: esta línea tiene foo

source: # Starting...
es_es: # Iniciando...

source: # These examples are subject to system-specific variation.
es_es: # Estos ejemplos están sujetos a variaciones específicas del sistema.

source: # Will throw an exception
es_es: # Lanzará una excepción

source: # or
es_es: # o

source: # same as
es_es: # es lo mismo que

source: # these examples are subject to system-specific variation
es_es: # estos ejemplos están sujetos a variaciones específicas del sistema

source: $!done = True;
es_es: $!realizado = True;

source: $cancellation.cancel;
es_es: $cancelación.cancel;

source: $channel.close;
es_es: $canal.close;

source: $channel.send($r);
es_es: $canal.send($r);

source: $channel.send('Channel One');
es_es: $canal.send('Canal Uno');

source: $eat.perform();
es_es: $comer.ejecutar();

source: $even_supply.tap(-> $v { say "Even : $v" });
es_es: $suministro_par.tap(-> $v { say "Par : $v" });

source: $half_supply.tap(-> $v { say "Half : $v" });
es_es: $medio_suministro.tap(-> $v { say "La mitad : $v" });

source: $lock.protect({
es_es: $bloqueo.protect({

source: $odd_supply.tap(-> $v { say "Odd : $v" });
es_es: $suministro_impar.tap(-> $v { say "Impar : $v" });

source: $proc.say("this line has foo");
es_es: $proc.say("esta línea tiene foo");

source: $proc.say("this one doesn't");
es_es: $proc.say("esta no");

source: $proc.stdout.tap(-> $v { print "Output: $v" });
es_es: $proc.stdout.tap(-> $v { print "Salida: $v" });

source: $promise.keep;
es_es: $promesa.keep;

source: $promise1.break("First Result");
es_es: $promesa1.break("Primer Resultado");

source: $promise1.keep("First Result");
es_es: $promesa1.keep("Primer Resultado");

source: $promise;
es_es: $promesa;

source: $supplier.done;
es_es: $proveedor.done;

source: $supplier.emit("OK");
es_es: $proveedor.emit("OK");

source: $supplier.emit("Won't trigger the tap");
es_es: $proveedor.emit("¡No llegará al tap!");

source: $supplier.emit($_);
es_es: $proveedor.emit($_);

source: $supplier.emit($r);
es_es: $proveedor.emit($r);

source: $supply.tap( -> $v { say "First : $v" });
es_es: $suministro.tap( -> $v { say "Primero : $v" });

source: $supply.tap( -> $v { say "Second : $v" });
es_es: $suministro.tap( -> $v { say "Segundo : $v" });

source: $supply.tap( -> $v { say $v });
es_es: $suministro.tap( -> $v { say $v });

source: $supply.tap(-> $v { say "First $v" });
es_es: $suministro.tap(-> $v { say "Primero $v" });

source: $supply.tap(-> $v { say "Original : $v" });
es_es: $suministro.tap(-> $v { say "Original : $v" });

source: $supply.tap(-> $v { say "Second $v"});
es_es: $suministro.tap(-> $v { say "Segundo $v"});

source: $supply.tap(-> $v { say $v });
es_es: $suministro.tap(-> $v { say $v });

source: $supply.tap: { ... },
es_es: $suministro.tap: { ... },

source: $thread.finish;
es_es: $hilo.finish;

source: $thread.run;
es_es: $hilo.run;

source: ($!upper.x - $!lower.x) * ( $!upper.y - $!lower.y);
es_es: ($!superior.x - $!inferior.x) * ( $!superior.y - $!inferior.y);

source: (may behave like Ps or Pe depending on usage)
es_es: (se comporta como Ps o Pe dependiendo de su uso)

source: + prefix non-negative number with a plus sign
es_es: + prefija un número no negativo con un signo más

source: - left-justify within the field
es_es: - justifica a la izquierda dentro del campo

source: -> $v { say $v.result; "Second Result"}
es_es: -> $v { say $v.result; "Segundo Resultado"}

source: ...; # your usual supply tap code here
es_es: ...; # el código del tap del suministro

source: .perform() for @!dependencies;
es_es: .ejecutar() for @!dependencias;

source: 64-bit integers)
es_es: enteros 64-bit)

source: =SUBTITLE A tutorial for creating and using classes in Perl 6
es_es: =SUBTITLE Un tutorial sobre la creación y uso de clases en Perl 6

source: =SUBTITLE Codepoint-String in Normal Form C (Composed)
es_es: =SUBTITLE Cadena Codepoint en Formato Normal C (Compuesta)

source: =SUBTITLE Codepoint-String in Normal Form D (Decomposed)
es_es: =SUBTITLE Cadena Codepoint en Formato Normal D (Decompuesto)

source: =SUBTITLE Codepoint-String in Normal Form KC (Compatibility Composed)
es_es: =SUBTITLE Cadena Codepoint en Formato Normal KC (Compatibilidad compuesta)

source: =SUBTITLE Codepoint-String in Normal Form KD (Compatibility Decomposed)
es_es: =SUBTITLE Cadena Codepoint en Formato Normal KD (Compatibilidad descompuesta)

source: =SUBTITLE Codepoint-String in Normal Form KD (Compatiblity Decomposed)
es_es: =SUBTITLE Cadena Codepoint en Formato Normal KD (Compatibilidad descompuesta)

source: =SUBTITLE Compilation error due to a malformed inline comment
es_es: =SUBTITLE Error de compilación debido a un comentario incrustado mal formado

source: =SUBTITLE Compilation error due to a regex quantifier without preceding atom
es_es: =SUBTITLE Error de compilación debido a un cuantificador regex sin que le preceda un átomo

source: =SUBTITLE Compilation error due to an `unless` clause followed by `else`
es_es: =SUBTITLE Error de compilación debido a que a una cláusula `unless` le sigue un `else`

source: =SUBTITLE Compilation error due to declaring a match variable
es_es: =SUBTITLE Error de compilación debido a la declaración de una variable de coincidencia

source: =SUBTITLE Compilation error due to unrecognized syntax
es_es: =SUBTITLE Error de compilación debido a sintaxis irreconocible

source: =SUBTITLE Compilation error due to use of Perl 5-only syntax
es_es: =SUBTITLE Error de compilación debido al uso de sintaxis propias de Perl 5

source: =SUBTITLE Compile-time routine
es_es: =SUBTITLE Rutina en tiempo de compilación

source: =SUBTITLE Concurrency and Asynchronous Programming
es_es: =SUBTITLE Concurrencia y Programación Asíncrona

source: =SUBTITLE Error due to calling return outside a routine
es_es: =SUBTITLE Error debido a la llamada a return fuera de una rutina

source: =SUBTITLE Error due to constructing a sequence from ineligible input
es_es: =SUBTITLE Error debido a la construcción de una secuencia desde una entrada no legible

source: =SUBTITLE Error due to directly trying to keep/break a vowed promise.
es_es: =SUBTITLE Error debido al intentar, directamente, mantener/romper una promesa jurada.

source: =SUBTITLE Error due to trying to reuse a consumed sequence
es_es: =SUBTITLE Error debido al intentar reutilizar una secuencia consumida

source: =SUBTITLE Error related to DateTime or Date
es_es: =SUBTITLE Error relacionado con DateTime o Date

source: =SUBTITLE Error while trying to change file permissions
es_es: =SUBTITLE Error al intentar cambiar los permisos de archivo

source: =SUBTITLE Error while trying to change the working directory
es_es: =SUBTITLE Error al intentar cambiar el directorio de trabajo actual

source: =SUBTITLE Error while trying to determine the current working directory
es_es: =SUBTITLE Error al intentar determinar el directorio de trabajo actual

source: =SUBTITLE Error while trying to get a directory's contents
es_es: =SUBTITLE Error al intentar obtener los contenidos de un directorio

source: =SUBTITLE Error while trying to remove a directory
es_es: =SUBTITLE Error al intentar eliminar un directorio

source: =SUBTITLE Error while trying to remove a file
es_es: =SUBTITLE Error al intentar eliminar un archivo

source: =SUBTITLE Exception thrown by L<Proc::Async>.
es_es: =SUBTITLE Excepción que se lanza por parte de L<Proc::Async>.

source: =SUBTITLE IO related error
es_es: =SUBTITLE Error relacionado con la E/S

source: =SUBTITLE Integer (native storage; machine precision)
es_es: =SUBTITLE Entero (almacenamiento nativo; precisión de la máquina)

source: =SUBTITLE Internal state of the regex engine during parsing
es_es: =SUBTITLE Estado interno del motor regex durante la interpretación

source: =SUBTITLE Item in a Pod enumeration list
es_es: =SUBTITLE Ítem en una lista enumerada Pod

source: =SUBTITLE Mutable buffer for binary data
es_es: =SUBTITLE Búfer mutable para datos binarios

source: =SUBTITLE Object that supports looking up values by key
es_es: =SUBTITLE Objeto que soporta localizar valores a partir de claves

source: =SUBTITLE Paragraph in a Pod document
es_es: =SUBTITLE Párrafo en un documento Pod

source: =SUBTITLE Perl 5 to Perl 6, in a nutshell: How do I do what I used to do?
es_es: =SUBTITLE Perl 5 a Perl 6, en pocas palabras: ¿Cómo hago lo que solía hacer?

source: =SUBTITLE Platform specific operations on file and directory paths QNX
es_es: =SUBTITLE Operaciones específicas de la plataforma en rutas de archivo o directorio para QNX

source: =SUBTITLE Platform specific operations on file and directory paths for Cygwin
es_es: =SUBTITLE Operaciones específicas de la plataforma en rutas de archivo o directorio para Cygwin

source: =SUBTITLE Platform specific operations on file and directory paths for POSIX
es_es: =SUBTITLE Operaciones específicas de la plataforma en rutas de archivo o directorio para POSIX

source: =SUBTITLE Platform specific operations on file and directory paths for Windows
es_es: =SUBTITLE Operaciones específicas de la plataforma en rutas de archivo o directorio para Windows

source: =SUBTITLE Pod related error
es_es: =SUBTITLE Error relacionado con Pod

source: =SUBTITLE Runtime error due to execution of stub code
es_es: =SUBTITLE Error en tiempo de ejecución debido a la ejecución de código talonero

source: =SUBTITLE Scheduler that blockingly executes code on the current thread
es_es: =SUBTITLE Planificador que bloquea la ejecución de código en el hilo actual

source: =SUBTITLE Scheduler that synchronously executes code on the current thread
es_es: =SUBTITLE Planificador que bloquea la ejecución de código en el hilo actual

source: =SUBTITLE String or object that can act as a string
es_es: =SUBTITLE String u objeto que puede actuar como una cadena

source: =SUBTITLE Syntax error thrown by the compiler
es_es: =SUBTITLE Error de sintaxis lanzado por el compilador

source: =SUBTITLE Unique identification for an object
es_es: =SUBTITLE Identificación única de un objeto

source: =TITLE Classes and Objects
es_es: =TITLE Clases y Objetos

source: =TITLE Concurrency
es_es: =TITLE Concurrencia

source: =TITLE class CurrentThreadScheduler
es_es: =TITLE clase CurrentThreadScheduler

source: =TITLE class Cursor
es_es: =TITLE clase Cursor

source: =TITLE class IO::Spec::Cygwin
es_es: =TITLE clase IO::Spec::Cygwin

source: =TITLE class IO::Spec::QNX
es_es: =TITLE clase IO::Spec::QNX

source: =TITLE class IO::Spec::Unix
es_es: =TITLE clase IO::Spec::Unix

source: =TITLE class IO::Spec::Win32
es_es: =TITLE clase IO::Spec::Win32

source: =TITLE class Macro
es_es: =TITLE clase Macro

source: =TITLE class NFC
es_es: =TITLE clase NFC

source: =TITLE class NFD
es_es: =TITLE clase NFD

source: =TITLE class NFKC
es_es: =TITLE clase NFKC

source: =TITLE class NFKD
es_es: =TITLE clase NFKD

source: =TITLE class ObjAt
es_es: =TITLE clase ObjAt

source: =TITLE class Pod::Block::Para
es_es: =TITLE clase Pod::Block::Para

source: =TITLE class Pod::Item
es_es: =TITLE clase Pod::Item

source: =TITLE class X::ControlFlow::Return
es_es: =TITLE clase X::ControlFlow::Return

source: =TITLE class X::IO::Chdir
es_es: =TITLE clase X::IO::Chdir

source: =TITLE class X::IO::Chmod
es_es: =TITLE clase X::IO::Chmod

source: =TITLE class X::IO::Cwd
es_es: =TITLE clase X::IO::Cwd

source: =TITLE class X::IO::Dir
es_es: =TITLE clase X::IO::Dir

source: =TITLE class X::IO::Rmdir
es_es: =TITLE clase X::IO::Rmdir

source: =TITLE class X::IO::Unlink
es_es: =TITLE clase X::IO::Unlink

source: =TITLE class X::Promise::Vowed
es_es: =TITLE clase X::Promise::Vowed

source: =TITLE class X::Seq::Consumed
es_es: =TITLE clase X::Seq::Consumed

source: =TITLE class X::Sequence::Deduction
es_es: =TITLE clase X::Sequence::Deduction

source: =TITLE class X::StubCode
es_es: =TITLE clase X::StubCode

source: =TITLE class X::Syntax::Comment::Embedded
es_es: =TITLE clase X::Syntax::Comment::Embedded

source: =TITLE class X::Syntax::Confused
es_es: =TITLE clase X::Syntax::Confused

source: =TITLE class X::Syntax::P5
es_es: =TITLE clase X::Syntax::P5

source: =TITLE class X::Syntax::Regex::SolitaryQuantifier
es_es: =TITLE clase X::Syntax::Regex::SolitaryQuantifier

source: =TITLE class X::Syntax::UnlessElse
es_es: =TITLE clase X::Syntax::UnlessElse

source: =TITLE class X::Syntax::Variable::Match
es_es: =TITLE clase X::Syntax::Variable::Match

source: =TITLE class int
es_es: =TITLE clase int

source: =TITLE role Associative
es_es: =TITLE rol Associative

source: =TITLE role Buf
es_es: =TITLE rol Buf

source: =TITLE role Stringy
es_es: =TITLE rol Stringy

source: =TITLE role X::IO
es_es: =TITLE rol X::IO

source: =TITLE role X::Pod
es_es: =TITLE rol X::Pod

source: =TITLE role X::Proc::Async
es_es: =TITLE rol X::Proc::Async

source: =TITLE role X::Syntax
es_es: =TITLE rol X::Syntax

source: =TITLE role X::Temporal
es_es: =TITLE rol X::Temporal

source: =begin code my $p1 = Promise.new; say $p1.status; # Planned; $p1.keep('result'); say $p1.status; # Kept say $p1.result; # result
es_es: =begin code my $p1 = Promise.new; say $p1.status; # Planificado; $p1.keep('resultado'); say $p1.status; # Guardado say $p1.result; # resultado

source: =head1 DESCRIPTION
es_es: =head1 DESCRIPCIÓN

source: =head1 Examples
es_es: =head1 Ejemplos

source: =head1 High-level APIs
es_es: =head1 Apis de alto nivel

source: =head1 Low-level APIs
es_es: =head1 APIs de bajo nivel

source: =head1 Methods
es_es: =head1 Métodos

source: =head1 NOTE
es_es: =head1 NOTA

source: =head1 SPECIAL VARIABLES
es_es: =head1 VARIABLES ESPECIALES

source: =head1 SYNOPSIS
es_es: =head1 SINOPSIS

source: =head1 Safety Concerns
es_es: =head1 Consideraciones de seguridad

source: =head1 Starting with class
es_es: =head1 Empezando con class

source: =head1 State
es_es: =head1 Estado

source: =head1 Syntax
es_es: =head1 Sintaxis

source: =head2 Attributes
es_es: =head2 Atributos

source: =head2 Channels
es_es: =head2 Canales

source: =head2 Deprecated and removed variables
es_es: =head2 Variables obsoletas y eliminadas

source: =head2 General Variables
es_es: =head2 Variables generales

source: =head2 Inheritance
es_es: =head2 Herencia

source: =head2 Locks
es_es: =head2 Bloqueos

source: =head2 Methods
es_es: =head2 Métodos

source: =head2 Promises
es_es: =head2 Promesas

source: =head2 Schedulers
es_es: =head2 Programadores

source: =head2 Signatures
es_es: =head2 Firmas

source: =head2 Smartmatch Operator
es_es: =head2 Operador Coincidencia inteligente

source: =head2 Supplies
es_es: =head2 Suministros

source: =head2 Switch Statements
es_es: =head2 Instrucciones Switch

source: =head2 Threads
es_es: =head2 Hilos

source: =head2 Variables related to filehandles
es_es: =head2 Variables relacionadas con identificadores de archivo

source: =head2 Variables related to regular expressions
es_es: =head2 Variables relacionadas con las expresiones regulares

source: =head2 Variables related to the interpreter state
es_es: =head2 Variables relacionadas con el estado del intérprete

source: =head2 method abs2rel
es_es: =head2 método abs2rel

source: =head2 method basename
es_es: =head2 método basename

source: =head2 method canonpath
es_es: =head2 método canonpath

source: =head2 method catdir
es_es: =head2 método catdir

source: =head2 method catfile
es_es: =head2 método catfile

source: =head2 method catpath
es_es: =head2 método catpath

source: =head2 method curdir
es_es: =head2 método curdir

source: =head2 method curupdir
es_es: =head2 método curupdir

source: =head2 method devnull
es_es: =head2 método devnull

source: =head2 method dir-sep
es_es: =head2 método dir-sep

source: =head2 method extension
es_es: =head2 método extension

source: =head2 method is-absolute
es_es: =head2 método is-absolute

source: =head2 method join
es_es: =head2 método join

source: =head2 method level
es_es: =head2 método level

source: =head2 method message
es_es: =head2 método message

source: =head2 method path
es_es: =head2 método path

source: =head2 method proc
es_es: =head2 método proc

source: =head2 method promise
es_es: =head2 método promise

source: =head2 method rel2abs
es_es: =head2 método rel2abs

source: =head2 method rootdir
es_es: =head2 método rootdir

source: =head2 method split
es_es: =head2 método split

source: =head2 method splitdir
es_es: =head2 método splitdir

source: =head2 method splitpath
es_es: =head2 método splitpath

source: =head2 method tmpdir
es_es: =head2 método tmpdir

source: =head2 method updir
es_es: =head2 método updir

source: =head3 Performance issues
es_es: =head3 Problemas de rendimiento

source: =head3 Variables related to formats
es_es: =head3 Variables relacionadas con formatos

source: =item $<I<digits>> ($1, $2, ...)
es_es: =item $<I<dígitos>> ($1, $2, ...)

source: =item -X DIRHANDLE
es_es: =item -X IDENTIFICADOR_DIR

source: =item binmode FILEHANDLE
es_es: =item binmode IDENTIFICADOR_ARCHIVO

source: =item exec LIST
es_es: =item exec LISTA

source: =item format
es_es: =item formato

source: =item getgrnam NAME
es_es: =item getgrnam NOMBRE

source: =item gethostbyaddr ADDR,ADDRTYPE
es_es: =item gethostbyaddr DIRECCIÓN,TIPODIR

source: =item gethostbyname NAME
es_es: =item gethostbyname NOMBRE

source: =item getnetbyaddr ADDR,ADDRTYPE
es_es: =item getnetbyaddr DIRECCIÓN,TIPODIR

source: =item getnetbyname NAME
es_es: =item getnetbyname NOMBRE

source: =item getprotobyname NAME
es_es: =item getprotobyname NOMBRE

source: =item getprotobynumber NUMBER
es_es: =item getprotobynumber NÚMERO

source: =item getservbyname NAME,PROTO
es_es: =item getservbyname NOMBRE,PROTO

source: =item getservbyport PORT,PROTO
es_es: =item getservbyport PUERTO,PROTO

source: =item goto &NAME
es_es: =item goto &NOMBRE

source: =item grep EXPR,LIST
es_es: =item grep EXPR,LISTA

source: =item kill SIGNAL, LIST
es_es: =item kill SEÑAL, LISTA

source: =item lstat DIRHANDLE
es_es: =item lstat IDENTIFICADOR_DIR

source: =item map EXPR,LIST
es_es: =item map EXPR,LISTA

source: =item mkdir FILENAME
es_es: =item mkdir ARCHIVO

source: =item my TYPE VARLIST
es_es: =item my TIPO VARLIST

source: =item my TYPE VARLIST : ATTRS
es_es: =item my TIPO VARLIST : ATRIBUTOS

source: =item my VARLIST : ATTRS
es_es: =item my VARLIST : ATRIBUTOS

source: =item no MODULE
es_es: =item no MÓDULO

source: =item no MODULE LIST
es_es: =item no MÓDULO LISTA

source: =item no MODULE VERSION
es_es: =item no MÓDULO VERSIÓN

source: =item no VERSION
es_es: =item no VERSIÓN

source: =item open FILEHANDLE
es_es: =item open IDENTIFICADOR_ARCHIVO

source: =item open FILEHANDLE,MODE,EXPR
es_es: =item open IDENTIFICADOR_ARCHIVO,MODO,EXPR

source: =item open FILEHANDLE,MODE,EXPR,LIST
es_es: =item open IDENTIFICADOR_ARCHIVO,MODO,EXPR,LISTA

source: =item open FILEHANDLE,MODE,REFERENCE
es_es: =item open IDENTIFICADOR_ARCHIVO,MODO,REFERENCIA

source: =item our TYPE VARLIST
es_es: =item our TIPO VARLIST

source: =item our TYPE VARLIST : ATTRS
es_es: =item our TIPO VARLIST : ATRIBUTOS

source: =item our VARLIST : ATTRS
es_es: =item our VARLIST : ATRIBUTOS

source: =item package NAMESPACE
es_es: =item package ESPACIO_NOMBRES

source: =item package NAMESPACE BLOCK
es_es: =item package ESPACIO_NOMBRES BLOQUE

source: =item print FILEHANDLE
es_es: =item print IDENTIFICADOR_ARCHIVO

source: =item print LIST
es_es: =item print LISTA

source: =item printf FILEHANDLE
es_es: =item printf IDENTIFICADOR_ARCHIVO

source: =item printf FORMAT, LIST
es_es: =item printf FORMATO, LISTA

source: =item say FILEHANDLE
es_es: =item say IDENTIFICADOR_ARCHIVO

source: =item say LIST
es_es: =item say LISTA

source: =item sethostent STAYOPEN
es_es: =item sethostent SIGUEABIERTO

source: =item setnetent STAYOPEN
es_es: =item setnetent SIGUEABIERTO

source: =item setprotoent STAYOPEN
es_es: =item setprotoent SIGUEABIERTO

source: =item setservent STAYOPEN
es_es: =item setservent SIGUEABIERTO

source: =item shmwrite ID,STRING,POS,SIZE
es_es: =item shmwrite ID,CADENA,POSICIÓN,TAMAÑO

source: =item splice ARRAY,OFFSET
es_es: =item splice ARRAY,DESPLAZAMIENTO

source: =item splice ARRAY,OFFSET,LENGTH
es_es: =item splice ARRAY,DESPLAZAMIENTO,LONGITUD

source: =item splice EXPR,OFFSET
es_es: =item splice EXPR,DESPLAZAMIENTO

source: =item splice EXPR,OFFSET,LENGTH
es_es: =item splice EXPR,DESPLAZAMIENTO,LONGITUD

source: =item splice EXPR,OFFSET,LENGTH,LIST
es_es: =item splice EXPR,DESPLAZAMIENTO,LONGITUD,LISTA

source: =item split /PATTERN/
es_es: =item split /PATRÓN/

source: =item split /PATTERN/,EXPR
es_es: =item split /PATRÓN/,EXPR

source: =item stat DIRHANDLE
es_es: =item stat IDENTIFICADOR_DIR

source: =item state TYPE VARLIST
es_es: =item state TIPO VARLIST

source: =item state TYPE VARLIST : ATTRS
es_es: =item state TIPO VARLIST : ATRIBUTOS

source: =item state VARLIST : ATTRS
es_es: =item state VARLIST : ATRIBUTOS

source: =item status
es_es: =item estado

source: =item sub NAME (PROTO) : ATTRS BLOCK
es_es: =item sub NOMBRE (PROTO) : ATRIBS BLOQUE

source: =item sub NAME (PROTO) BLOCK
es_es: =item sub NOMBRE (PROTO) BLOQUE

source: =item sub NAME : ATTRS BLOCK
es_es: =item sub NOMBRE : ATRIBS BLOQUE

source: =item substr EXPR,OFFSET
es_es: =item substr EXPR,DESPLAZAMIENTO

source: =item substr EXPR,OFFSET,LENGTH
es_es: =item substr EXPR,DESPLAZAMIENTO,LONGITUD

source: =item sysopen FILEHANDLE,FILENAME,MODE,PERMS
es_es: =item sysopen IDENTIFICADOR_ARCHIVO,ARCHIVO,MODO,PERMISOS

source: =item sysread FILEHANDLE,SCALAR,LENGTH
es_es: =item sysread IDENTIFICADOR_ARCHIVO,ESCALAR,LONGITUD

source: =item system LIST
es_es: =item system LISTA

source: =item system PROGRAM LIST
es_es: =item system PROGRAMA LISTA

source: =item syswrite FILEHANDLE,SCALAR
es_es: =item syswrite IDENTIFICADOR_ARCHIVO,ESCALAR

source: =item syswrite FILEHANDLE,SCALAR,LENGTH
es_es: =item syswrite IDENTIFICADOR_ARCHIVO,ESCALAR,LONGITUD

source: =item truncate EXPR,LENGTH
es_es: =item truncate EXPR,LONGITUD

source: =item unlink LIST
es_es: =item unlink LISTA

source: =item unpack TEMPLATE
es_es: =item unpack PLANTILLA

source: =item unshift EXPR,LIST
es_es: =item unshift EXPR,LISTA

source: =item use Module
es_es: =item use Módulo

source: =item use Module LIST
es_es: =item use Módulo LISTA

source: =item use Module VERSION
es_es: =item use Módulo VERSIÓN

source: =item use Module VERSION LIST
es_es: =item use Módulo VERSIÓN LISTA

source: =item use VERSION
es_es: =item use VERSIÓN

source: =item utime LIST
es_es: =item utime LISTA

source: =item waitpid PID,FLAGS
es_es: =item waitpid PID,INDICADORES

source: A possibly better fix would be to refactor the code so that sharing a container is not necessary.
es_es: Una solución más conveniente sería cambiar el código de forma que no se necesario compartir ese elemento.
